//Задание 5
//Пользователь с клавиатуры вводит в строку ариф-
//метическое выражение. Приложение должно посчитать
//его результат. Необходимо поддерживать только две
//операции: +и –.

namespace Task_5
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}