//Задание 4
//Создайте приложение, которое производит операции над матрицами:
//■Умножение матрицы на число;
//■Сложение матриц;
//■Произведение матриц.

namespace Task_4
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}